JEP/Hpoo/HpooTemplate_RequestResponse.xml

<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><Service_Provisioning_Info xmlns="http://rjil.com/ericsson/inventoryProvisioning/datastructure"><Service_Information><Service_ID>482222050055</Service_ID></Service_Information><Node_List><Node><Node_Name>INMUMUMBXXXXNB0016ENBESS001</Node_Name><Node_HostName>MUMBRLB1ECR001</Node_HostName><Node_Type>L2 Switch</Node_Type><Node_Vendor>RAD LTD</Node_Vendor><Node_Model>RL-ETX203AX</Node_Model><Template_ID>L2_TemplateR03</Template_ID><Template_Name>L2_Ring_tagged_BW_RAD</Template_Name><Parameter_List><Parameter>$ProductType$:L3VPN</Parameter><Parameter>$ServiceCode$:VPN</Parameter><Parameter>$shaper_bandwidth$:1024</Parameter><Parameter>$WAN_IP_1$:116.50.76.136</Parameter><Parameter>$ServiceID$:482222050055</Parameter><Parameter>$CustomerID$:9190052328</Parameter><Parameter>$VLAN_TAGGED$:TAGGED</Parameter><Parameter>$CUSTOMERNAME$:Pmjgcgek6967</Parameter><Parameter>$VLANID$:2135</Parameter><Parameter>$bandwidth$:1 Mbps</Parameter><Parameter>$PORT$:13</Parameter><Parameter>$PORT2:Ethernet 1</Parameter><Parameter>$PORT_ID$:13</Parameter><Parameter>$CustomerName$:Pmjgcgek6967</Parameter><Parameter>$policer_bandwidth$:1024</Parameter><Parameter>$LastMileType$:Ethernet</Parameter><Parameter>$InterfaceDescription$:UNI-ENT-L3VPN-MPLS-Pmjg-1 Mbps:482222050055</Parameter><Parameter>$b_bandwidth$:1 Mbps</Parameter><Parameter>$TCoS$:CoS1</Parameter><Parameter>$q_dirblock$:0/4</Parameter><Parameter>$pbit$:0</Parameter><Parameter>$ring_number$:</Parameter></Parameter_List></Node><Node><Node_Name>INMUMUMBXXXXNB0016ENBPAR001</Node_Name><Node_HostName>BGLRRLABECR001</Node_HostName><Node_Type>AG1</Node_Type><Node_Vendor>CISCO</Node_Vendor><Node_Model>CS-ASR-903-PAR</Node_Model><Template_ID>AG1_Template12</Template_ID><Template_Name>L3VPN_Ethernet_AG1_PW_Primary</Template_Name><Parameter_List><Parameter>$ProductType$:L3VPN</Parameter><Parameter>$ServiceCode$:VPN</Parameter><Parameter>$CustomerID$:9190052328</Parameter><Parameter>$CUSTOMERNAME$:Pmjgcgek6967</Parameter><Parameter>$VLANID$:2135</Parameter><Parameter>$PWID$:100074</Parameter><Parameter>$LastMileType$:Ethernet</Parameter><Parameter>$Port0$:GigabitEthernet0/0/8</Parameter><Parameter>$TCoS$:CoS1</Parameter><Parameter>$b_bandwidth$:1 Mbps</Parameter><Parameter>$description$:UNI-ENT-L3VPN-MPLS-Pmjg-1 Mbps:482222050055</Parameter><Parameter>$Port1$:TenGigabitEthernet0/0/27</Parameter><Parameter>$pbit$:0</Parameter><Parameter>$ring_number$:</Parameter><Parameter>$AG2LoopbackIP$:10.64.2.66</Parameter></Parameter_List></Node><Node><Node_Name>INMUMUMBXXXXNB0017MA2AAR001</Node_Name><Node_HostName>BGLRRLABAAR001</Node_HostName><Node_Type>AG2</Node_Type><Node_Vendor>CISCO</Node_Vendor><Node_Model>CS-ASR-9010-DCV2-AAR</Node_Model><Template_ID>AG2_Template03</Template_ID><Template_Name>L3VPN_AG2_Ethernet_Static_PW_Spur</Template_Name><Parameter_List><Parameter>$VRFName$:RJIL-ENT-PMJG-901900000359-SPOKE</Parameter><Parameter>$Route DisTinGuisher$:10.64.2.66:20146</Parameter><Parameter>$WAN IPV4 2$:116.50.76.137</Parameter><Parameter>$WAN IPV4 2$:116.50.76.137</Parameter><Parameter>$CustomerID$:9190052328</Parameter><Parameter>$Wan IPV4 1$:116.50.76.138</Parameter><Parameter>$Wan IPV4 1$:116.50.76.138</Parameter><Parameter>$ECRLoopbackIP$:</Parameter><Parameter>$rt_import$:64771:2100093379</Parameter><Parameter>$AG1LoopbackIP$:10.64.2.85</Parameter><Parameter>$VLANID$:2135</Parameter><Parameter>$CUSTOMERNAME$:Pmjgcgek6967</Parameter><Parameter>$PWID$:100074</Parameter><Parameter>$LastMileType$:Ethernet</Parameter><Parameter>$b_bandwidth$:1 Mbps</Parameter><Parameter>$TCoS$:CoS1</Parameter><Parameter>$WAN IP 4 Address$:116.50.76.137</Parameter><Parameter>$device_ip$:10.64.2.66</Parameter><Parameter>$rt_export$:64771:3100093390</Parameter><Parameter>$pbit$:0</Parameter><Parameter>$PortAccessID$:TenGigabitEthernet0/0/1</Parameter><Parameter>$ProductType$:L3VPN</Parameter><Parameter>$Bandwidth$:1 Mbps</Parameter><Parameter>$ServiceID$:482222050055</Parameter><Parameter>$CustomerIppool$:116.50.76.228/30</Parameter><Parameter>$BWbps$:187500</Parameter><Parameter>$Bvi$:5069</Parameter><Parameter>$ABC$:RT:import 64771:2100093379</Parameter><Parameter>$ring_number$:</Parameter></Parameter_List></Node><Node><Node_Name>INMUMUMBRLB1NB0020AG3AAR001</Node_Name><Node_HostName>MUMBRLB1AAR001</Node_HostName><Node_Type>Delta_AG2</Node_Type><Node_Vendor>CISCO</Node_Vendor><Node_Model>CS-ASR-9010-DCV2-AAR</Node_Model><Template_ID>AG2_Template07</Template_ID><Template_Name>L3VPN_Ethernet_Delta_Hub_AG2</Template_Name><Parameter_List><Parameter>$ProductType$:L3VPN</Parameter><Parameter>$VRFName$:RJIL-ENT-PMJG-901900000359-HUB</Parameter><Parameter>$LastMileType$:Ethernet</Parameter><Parameter>$TCoS$:CoS1</Parameter><Parameter>$ServiceID$:482222050055</Parameter><Parameter>$rt_import$:64771:3100093390</Parameter><Parameter>$rt_export$:64771:2100093379</Parameter><Parameter>$pbit$:0</Parameter><Parameter>$ring_number$:</Parameter></Parameter_List></Node><Node><Node_Name>INMUMUMBXXXXNB0016ENBPAR002</Node_Name><Node_HostName>BGLRRLABECR002</Node_HostName><Node_Type>AG1</Node_Type><Node_Vendor>CISCO</Node_Vendor><Node_Model>CS-ASR-903-PAR</Node_Model><Template_ID>AG1_Template13</Template_ID><Template_Name>L3VPN_Ethernet_AG1_PW_Secondary</Template_Name><Parameter_List><Parameter>$ProductType$:L3VPN</Parameter><Parameter>$ServiceCode$:VPN</Parameter><Parameter>$CustomerID$:9190052328</Parameter><Parameter>$CUSTOMERNAME$:Pmjgcgek6967</Parameter><Parameter>$VLANID$:2135</Parameter><Parameter>$PWID$:100074</Parameter><Parameter>$LastMileType$:Ethernet</Parameter><Parameter>$Port0$:GigabitEthernet0/0/8</Parameter><Parameter>$TCoS$:CoS1</Parameter><Parameter>$b_bandwidth$:1 Mbps</Parameter><Parameter>$description$:UNI-ENT-L3VPN-MPLS-Pmjg-1 Mbps:482222050055</Parameter><Parameter>$Port1$:TenGigabitEthernet0/0/26</Parameter><Parameter>$pbit$:0</Parameter><Parameter>$ring_number$:</Parameter><Parameter>$AG2LoopbackIP$:10.64.2.66</Parameter></Parameter_List></Node></Node_List></Service_Provisioning_Info></S:Body></S:Envelope>